# Time methods in Pandas

In [1]:
import numpy as np
import pandas as pd
from datetime import datetime

## Extracting current date and time:

In [2]:
x=datetime.utcnow()
x

datetime.datetime(2023, 7, 30, 23, 42, 16, 565231)

### creating datetime objects:

In [3]:
d=4
m=8
y=1945
h=8
minute=15
s=0
tt=datetime(y,m,d,h,minute,s)
tt

datetime.datetime(1945, 8, 4, 8, 15)

In [4]:
tt.year

1945

In [5]:
tt.second

0

## Taking the datetime data into Series object and cleaning the data:

In [6]:
myser=pd.Series(['Nov 3,1999','2000-1-1',None])
myser

0    Nov 3,1999
1      2000-1-1
2          None
dtype: object

### Cleaning data:

In [7]:
myser=pd.to_datetime(myser)
myser

0   1999-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

### Custom Date Format:

In [8]:
y='12--Dec--2014'
y=pd.to_datetime(y,format='%d--%b--%Y')
y

Timestamp('2014-12-12 00:00:00')

### changing the object datatype to datetime object:

In [9]:
df=pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [10]:
df

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [11]:
type(df['DATE'])

pandas.core.series.Series

In [12]:
df['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [13]:
df['DATE']=pd.to_datetime(df['DATE'])
df['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

### Sampling data of dates:

In [15]:
df=df.set_index('DATE')
df

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [19]:
df=df.reset_index()
df

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [20]:
df['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [21]:
df['YEAR']=df['DATE'].dt.year
df

          DATE  MRTSSM4453USN  YEAR
0   1992-01-01           1509  1992
1   1992-02-01           1541  1992
2   1992-03-01           1597  1992
3   1992-04-01           1675  1992
4   1992-05-01           1822  1992
..         ...            ...   ...
335 2019-12-01           6630  2019
336 2020-01-01           4388  2020
337 2020-02-01           4533  2020
338 2020-03-01           5562  2020
339 2020-04-01           5207  2020

[340 rows x 3 columns]

In [22]:
df=df.groupby("YEAR").mean()
df

      MRTSSM4453USN
YEAR
1992    1807.250000
1993    1794.833333
1994    1841.750000
1995    1833.916667
1996    1929.750000
1997    2006.750000
1998    2115.166667
1999    2206.333333
2000    2375.583333
2001    2468.416667
2002    2491.166667
2003    2539.083333
2004    2682.416667
2005    2797.250000
2006    3001.333333
2007    3177.333333
2008    3292.000000
2009    3353.750000
2010    3450.083333
2011    3532.666667
2012    3697.083333
2013    3839.666667
2014    4023.833333
2015    4212.500000
2016    4434.416667
2017    4602.666667
2018    4830.666667
2019    4972.750000
2020    4922.500000